Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoilingIATE/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            prghPressure;
        p               uniform 100000;
        value           uniform 100000;
    }
    wall1
    {
        type            fixedFluxPressure;
    }
    wall2
    {
        type            fixedFluxPressure;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
